day1/2_sonicForwardStep/2_forwardStep_refined/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       13790;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       13850;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          50;
        startFace       13890;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          150;
        startFace       13940;
    }
    obstacle
    {
        type            patch;
        nFaces          120;
        startFace       14090;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          14000;
        startFace       14210;
    }
)

// ************************************************************************* //
